#include "headfile.h"






//====================一些常用函数================================================================
/******************************************************************************************
*函数名:		osal_memset
*参数:			无
*返回值:		无
*描述:			内存内容设置
*编写:			
*版本信息:		
******************************************************************************************/
void osal_memset( void *dest, uint8 value, int len )
{
    memset( dest, value, len );
}
/******************************************************************************************
*函数名:		MemoryCompare
*参数:			无
*返回值:		无
*描述:			内存比较
*编写:			
*版本信息:		
******************************************************************************************/
pU8 MemoryCompare(void *psmem,void *pdmem,pU32 len)
{
 pU32 i=0;
 pU8 *pSmem=(pU8*)psmem;
 pU8 *pDmem=(pU8*)pdmem;
 
 for(i=0;i<len;i++)
 {
  if(*pSmem!=*pDmem)
  {
   return 0;
  }
  pSmem++;
  pDmem++;
 }
 return 1;
}
/******************************************************************************************
*函数名:		MemoryCopy
*参数:			无
*返回值:		无
*描述:			内存拷贝
*编写:			
*版本信息:		
******************************************************************************************/
void * MemoryCopy(void *pdmem,void *psmem,pU32 len)
{
 pU32 i=0;
 pU8 *pSmem=(pU8*)psmem;
 pU8 *pDmem=(pU8*)pdmem;

 for(i=0;i<len;i++)
 {
  *pDmem=*pSmem;
   pSmem++;
   pDmem++;
 }

 return pdmem;
}
/******************************************************************************************
*函数名:		StringCopy
*参数:			dest_str:目标指针  src_str:源指针
*返回值:		无
*描述:			字符串拷贝
*编写:			
*版本信息:		
******************************************************************************************/
pS8 * StringCopy(pS8 *dest_str,pS8 *src_str)
{
 pU8 i=0;

 while('\0'!=src_str[i])
 {
  dest_str[i]=src_str[i];
  i++;
 }

 dest_str[i]='\0';

 return dest_str;
}
/******************************************************************************************
*函数名:		StringLen
*参数:			无
*返回值:		无
*描述:			字符串长度
*编写:			
*版本信息:		
******************************************************************************************/
pU32 StringLen(const pU8 *pstr)
{
 pU32 len=0;
 if(pstr==NULL)return 0;
 
 while('\0'!=pstr[len]) 
 {
  len++;
 }
 return len;
}
/******************************************************************************************
*函数名:		WStringLen
*参数:			无
*返回值:		无
*描述:			16bit 字符串长度
*编写:			
*版本信息:		
******************************************************************************************/
pU32 WStringLen(pU16 *str)
{
 pU32 i=0;
 while(0!=str[i])
 {
  i++;
 }

 return i;
}
/******************************************************************************************
*函数名:		pS_OsMalloc
*参数:			无
*返回值:		无
*描述:			申请内存
*编写:			
*版本信息:		
******************************************************************************************/
void *pS_OsMalloc(pU16 mSize)
{
	return mem_4_malloc(mSize);
}
/******************************************************************************************
*函数名:		pS_OsFree
*参数:			无
*返回值:		无
*描述:			释放内存
*编写:			
*版本信息:		
******************************************************************************************/
void pS_OsFree(void *pFreeBuffer)
{
	mem_4_free(pFreeBuffer);	
}



